[
    {
        "name":"Acolyte",
        "skillProf":{
            "get":[
                "Insight",
                "Religion"
            ]
        },
        "languages":{
            "choice":[
                {
                    "number":"2",
                    "choices":[
                        "*lang"
                    ]
                }
            ]
        },
        "equipment":{
            "get":[
                {"Holy symbol (a gift to you when you entered the priesthood)":"1"},
                {"Prayer book or prayer wheel":"1"},
                {"Sticks of incence":"5"},
                {"Vestments":"1"},
                {"Set of common clothes":"1"},
                {"gp":"15"}
            ]
        },
        "features":[
            {
                "name":"Shelter of the Faithful",
                "description":"As an acolyte, you command the respect of those who share your faith, and you can perform religious cerimonies of your deity. You and your adventuring companions can expect to receive free healing and care at a temple, shrine, or other established presence of your faith, though you must provide any material components needed for spells. Those who share your religion will support you (but only you) at a modest lifestyle.<br />You might also have ties to a specific temple dedicated to your chosen deity or pantheon, and you have a residence there. This could be the temple where you used to serve, if you remain on good terms with it, or a temple where you can call upon priests for assistance, provided the assistance you ask for is not hazardous and you remain in good standing with your temple."
            }
        ]
    },
    {
        "name":"Charlatan",
        "skillProf":{
            "get":[
                "Deception",
                "Sleight of Hand"
            ]
        },
        "toolProf":{
            "get":[
                "Disguise kit",
                "Forgery kit"
            ]
        },
        "equipment":{
            "get":[
                {"Set of fine clothes":"1"},
                {"Disguise kit":"1"},
                {"gp":"15"}
            ],
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        {"Stoppered bottles filled with colored liquid":"10"},
                        {"Set of weighted dice":"1"},
                        {"Deck of marked cards":"1"},
                        {"Signet ring of an imaginary duke":"1"}
                    ]
                }
            ]
        },
        "features":[
            {
                "name":"False Identity",
                "description":"You have created a second identity that includes documentation, established acquaintances, and disguises that allow you to assume that persona. Additionaly, you can forge documents including official papers and personal letters, as long as you have seen and example of the kind of document or handwriting you are trying to copy."
            }
        ]
    },
    {
        "name":"Criminal",
        "skillProf":{
            "get":[
                "Deception",
                "Stealth"
            ]
        },
        "toolProf":{
            "get":[
                "Thieves' tools"
            ],
            "choice":[
                    {
                    "number":"1",
                    "choices":[
                        "*games"
                    ]
                }
            ]
        },
        "features":[
            {
                "name":"Criminal Contact",
                "description":"You have a reliable and trustworthy contact who acts as your liaison to a network of other criminals. You know how to get messages to and from your contact, even over great distances; specificaly, you know the local messengers, corrupt caravan masters, and seedy sailors who can deliver messages for you."
            }
        ]
    },
    {
        "name":"Entertainer",
        "skillProf":{
            "get":[
                "Acrobatics",
                "Performance"
            ]
        },
        "toolProf":{
            "get":[
                "Disguise kit"
            ],
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        "*instrument"
                    ]
                }
            ]
        },
        "equipment":{
            "get":[
                {"Costume":"1"},
                {"gp":"15"}
            ],
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        {"*instrument":"1"}
                    ]
                },
                {
                    "number":"1",
                    "choices":[
                        {"Love letter":"1"},
                        {"Lock of hair":"1"},
                        {"Trinket":"1"}
                    ]
                }
            ]
        },
        "features":[
            {
                "name":"By Popular Demand",
                "description":"You can always find a place to perform, usually in an inn or tavern but possibly with a circus, at a theater, or even in a noble's court. At such a place, you receive free lodging and food of a modest or comfortable standard (depending on the quality of the establishment), as long as you perform each night. In addition, your performance makes you somthing of a local figure. When strangers recognize you in a town where you have performed, they typicaly take a liking to you."
            }
        ]
    },
    {
        "name":"Folk Hero",
        "skillProf":{
            "get":[
                "Animal Handling",
                "Survival"
            ]
        },
        "toolProf":{
            "get":[
                "Land vehicls"
            ],
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        "*artisan"
                    ]
                }
            ]
        },
        "equipment":{
            "get":[
                {"Shovel":"1"},
                {"Iron pot":"1"},
                {"Common cloths":"1"},
                {"gp":"10"}
            ],
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        {"*artisan":"1"}
                    ]
                }
            ]
        },
        "features":[
            {
                "name":"Rustic Hospitality",
                "description":"Since you come from the ranks of the common folk, you fit in among them with ease. You can find a place to hide, rest, or recuperate among other commoners, unlass you have shown yourself to be a danger to them. They will shield you from the law or anyone else searching for you, though they will not risk their lives for you."
            }
        ]
    },
    {
        "name":"Guild Artisan",
        "skillProf":{
            "get":[
                "Insight",
                "Persuasion"
            ]
        },
        "toolProf":{
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        "*artisan"
                    ]
                }
            ]
        },
        "equipment":{
            "get":[
                {"Letter of introduction from your guild":"1"},
                {"Traveler's cloaths":"1"},
                {"gp":"15"}
            ],
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        "*artisan"
                    ]
                }
            ]
        },
        "features":[
            {
                "name":"Guild Membership",
                "description":"As an established and respected member of a guild, you can rely on certain benefits that membership provides. Your fellow guild members will provide you with lodging and food if necessary, and pay for your funeral if needed. In some cities and towns, a guildhall offers a central place to meet other members of your profession, which can be a good place to meet potential patrons, allies, or hirelings.<br />Guilds often wield tremendous political power. If you are accused of a crime, your guild will support you if a good case can be made for your innocence or the crime is justifiable. You can also gain access to powerful political figures through the guild, if you are a member in good standing. Such connections might reqire the donation of money or magic items to the guild's coffers.<br />You must pay dues of 5gp per month to the guild. If you miss payments, you must makeup back dues to remain in the guild's good graces."
            }
        ]
    },
    {
        "name":"Hermit",
        "skillProf":{
            "get":[
                "Medicine",
                "Religion"
            ]
        },
        "toolProf":{
            "get":[
                "Herbalism kit"
            ]
        },
        "languages":{
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        "*lang"
                    ]
                }
            ]
        },
        "equipment":{
            "get":[
                {"Scroll case stuffed full of notes from your studies or prayers":"1"},
                {"Winter blanket":"1"},
                {"Common clothes":"1"},
                {"Herbalism kit":"1"},
                {"gp":"5"}
            ]
        },
        "features":[
            {
                "name":"Discovery",
                "description":"The quiet seclusion of your extended hermitage gave you access to a unique and powerful discovery. The exact nature of this revelation depends on the nature of your seclusion. It might be a great truth about the cosmos, the deities, the powerful beings of the outer planets, or the forces of nature. It could be a site that no one else has ever seen. You might have uncovered a fact that has long been forgotten, or unearthed some relic of the past that could rewrite history. It might be information that would be damaging to the people who or consigned you to exile, and hence the reason for your return to society.<br />Work with your DM to determine the details of your discovery and its impact on the campaign."
            }
        ]
    },
    {
        "name":"Noble",
        "skillProf":{
            "get":[
                "History",
                "Persuasion"
            ]
        },
        "toolProf":{
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        "*games"
                    ]
                }
            ]
        },
        "languages":{
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        "*lang"
                    ]
                }
            ]
        },
        "equipment":{
            "get":[
                {"Fine clothes":"1"},
                {"Signet ring":"1"},
                {"Scroll of pedigree":"1"},
                {"gp":"25"}
            ]
        },
        "features":[
            {
                "name":"Position of Privilege",
                "description":"Thanks to your noble birth, people are inclined to think the best of you. You are welcome in high society, and people assume you have the right to be whatever you are. The common folk make every effort to accommadate you and avoid your displeasure, and other people of high birth treat you as a member of the same social sphere. You can secure an audience with a local noble if you need to."
            }
        ]
    },
    {
        "name":"Outlander",
        "skillProf":{
            "get":[
                "Athletics",
                "Survival"
            ]
        },
        "toolProf":{
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        "*instrument"
                    ]
                }
            ]
        },
        "languages":{
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        "*lang"
                    ]
                }
            ]
        },
        "equipment":{
            "get":[
                {"Staff":"1"},
                {"Hunting trap":"1"},
                {"Trophy from an animal you killed":"1"},
                {"Traveler's cloths":"1"},
                {"gp":"10"}
            ]
        },
        "features":[
            {
                "name":"Wanderer",
                "description":"You have an exellent memory for maps and geography, and you can always recall the general layout of terrain, settlements, and other features around you. In addition, you can find food and fresh water for yourself and up to five other people each day, provided that the land offers berries, small game, water, and so forth."
            }
        ]
    },
    {
        "name":"Sage",
        "skillProf":{
            "get":[
                "Arcana",
                "History"
            ]
        },
        "languages":{
            "choice":[
                {
                    "number":"2",
                    "choices":[
                        "*lang"
                    ]
                }
            ]
        },
        "equipment":{
            "get":[
                {"Bottle of black ink":"1"},
                {"Quill":"1"},
                {"Small knife":"1"},
                {"Letter from a dead colleage posing a questing you have not been able to answer":"1"},
                {"Common clothes":"1"},
                {"gp":"10"}
            ]
        },
        "features":[
            {
                "name":"Researcher",
                "description":"When you attempt to learn or recall a piece of lore, if you do not know that information, you often know where and from whom you can obtain it. Usually, this information somes from a library, scriptorium, university, or a sage or other learned person or creatures. Your DM might rule that the knowladge you seek is secured away in an almost inaccessible place, or that it simply cannot be found. Unearthing the deepest secrets of the multiverse can require an adventure or even a whole campaign."
            }
        ]
    },
    {
        "name":"Sailor",
        "skillProf":{
            "get":[
                "Athletics",
                "Perception"
            ]
        },
        "toolProf":{
            "get":[
                "Navigator's tools",
                "Water vehicles"
            ]
        },
        "equipment":{
            "get":[
                {"Belaying pin (club)":"1"},
                {"Silk rope":"50ft"},
                {"Lucky charm such as a rabbit foot or a small stone with a hole in the center (or you may roll for a random trinket on the Trinkets table)":"1"},
                {"Common clothes":"1"},
                {"gp":"10"}
            ]
        },
        "features":[
            {
                "name":"Ship's Passage",
                "description":"When you need to, you can secure free passage on a sailing ship for yourself and your adventuring companions. You might sail on the ship you served on, or another ship you have good relations with (perhaps one captained by a former crewmate). Because you're calling in a favor, you can't be cirtain of a schedule or route that will meet your every need. Your Dungeon Master will determine how long it takes to get where you need to go. In return for youe free passage, you and your companions are expected to assist the crew during the voyage."
            }
        ]
    },
    {
        "name":"Soldier",
        "skillProf":{
            "get":[
                "Athletics",
                "Intimidation"
            ]
        },
        "toolProf":{
            "get":[
                "Land vehicles"
            ],
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        "*games"
                    ]
                }
            ]
        },
        "equipment":{
            "get":[
                {"Insignia of rank":"1"},
                {"Trophy taken from a fallen enemy (a dagger, broken blade, or piece of a banner)":"1"},
                {"Common cloths":"1"},
                {"gp":"10"}
            ],
            "choice":[
                {
                    "number":"1",
                    "choices":[
                        {"Bone dice":"1"},
                        {"Deck of cards":"1"}
                    ]
                }
            ]
        },
        "features":[
            {
                "name":"Military Rank",
                "description":"You have a military rank from your career as a soldier. Soldiers loyal to your former military organization still recognize your athority and influence, and they defer to you if they are of a lower rank. You can invoke your rank to exert influence over other soldiers and requisition simple equipment or horses for temporary use. You can also usually gain access to friendly military encampments and fortresses where your rank is recognized."
            }
        ]
    },
    {
        "name":"Urchin",
        "skillProf":{
            "get":[
                "Sleight of Hand",
                "Stealth"
            ]
        },
        "toolProf":{
            "get":[
                "Disguise kit",
                "Thieves' tools"
            ]
        },
        "equipment":{
            "get":[
                {"Small knife":"1"},
                {"Map of the city you grew up in":"1"},
                {"Pet mouse":"1"},
                {"Token to remember your parents by":"1"},
                {"Common clothes":"1"},
                {"gp":"10"}
            ]
        },
        "features":[
            {
                "name":"City Secrets",
                "description":"You know the secret patterns and flow to cities and can find passages through the urban sprawl that others would miss. When you are not in combat, you (and companions you lead) can travel between any two locations in a city twice as fast as your speed would normally allow."
            }
        ]
    }
]